{
    "course_info": "PHY203: ELEMENTARY PHYSICS I (Fall 2024)\n\nInstructor: Miquel Dorca\nOffice: 211 East Hall\nEmail: miquel@uri.edu\nOffice Hours: MWF 12:30pm -1:00pm\n\nLecture Times: MWF 1pm-1:50pm (East Hall Auditorium)\n\nCourse Description: Calculus-based introduction to Newtonian mechanics. Topics include kinematics and dynamics of particles and systems of particles, conservation laws, rotational motion, gravitation, and oscillatory motion.\n\nPrerequisites: Credit or concurrent enrollment in MTH 141 and concurrent enrollment in PHY 273.\n\nIntended for science and engineering majors.\n\nTextbook: University Physics (OpenStax), 1st Edition, Volume 1. Available for free at https://openstax.org/subjects/science.\n\nCourse Goals:\n1. Develop a conceptual and quantitative understanding of kinematics.\n2. Develop a conceptual and quantitative understanding of forces.\n3. Develop a conceptual and quantitative understanding of work, energy, and energy conservation.\n4. Develop a conceptual and quantitative understanding of linear momentum and its conservation.\n5. Develop a conceptual and quantitative understanding of rotational kinematics, rotational dynamics, and angular momentum conservation.\n6. Develop a conceptual and quantitative understanding of oscillations and simple harmonic motion.\n\nGeneral Education Areas: This course satisfies URI's general education areas: \"Scientific, Technology, Engineering, and Mathematical Disciplines\" (Full); and \"Mathematical, Statistical, or Computational Strategies\" (Partial).\n\nLearning Outcomes:\n1. Demonstrate an understanding of the basic concepts of classical mechanics.\n2. Apply a conceptual understanding of classical mechanics to physics problems.\n3. Develop problem-solving strategies and techniques appropriate to classical mechanics.\n4. Carry out quantitative solutions of classical mechanics problems.\n5. Carry out, analyze, and present the results of classical mechanics laboratory experiments.\n\nBrightspace: The class will use Brightspace for class announcements and all lectures will be posted there. If the course needs to go remote (e.g., due to a weather cancellation), lectures will be given asynchronously on Brightspace, except on November 25th, 27th, and December 2nd where it will be asynchronous regardless of cancellations.\n\nInstructor Contact Details:\nEmail: miquel@uri.edu\nOffice: 211 East Hall\nOffice Hours: MWF 12:30pm -1:00pm",
    "schedule": "Lecture Times: MWF 1pm-1:50pm (East Hall Auditorium)\n\nBrightspace Announcements and Asynchronous Lectures on November 25th, 27th, December 2nd.\n\nRecitation Sessions: To be scheduled separately for PHY273.\n\nLaboratory Sessions: PHY273 Laboratory Schedule includes specific dates from September 9th to December 12th in Room 112.\n\nCourse Meeting Pattern: MWF\n\nLocations: East Hall Auditorium for lectures, Room 112 for recitations and labs.\n\nSpecial Dates:\n- November 25th, 27th, December 2nd: Asynchronous lectures on Brightspace.\n- December 12th: Make-up Lab (Pendulum) on Reading Day.",
    "assignments": "Homework Assignments will be due on or before (usually Wednesdays or Fridays) of almost every week by 10 p.m. and will be administered through WebAssign.\n\nDetails:\n- HW #1 due Wed., Sept. 11\n- HW #2 due Wed., Sept. 18\n- HW #3 due Fri., Sept. 25\n- HW #4 due Fri., Oct. 4\n- HW #5 due Fri., Oct. 18\n- HW #6 due Fri., Oct. 25\n- HW #7 due Fri., Oct. 30\n- HW #8 due Wed., Nov. 6\n- HW #9 due Wed., Nov. 13\n- HW #10 due Wed., Dec. 4\n- HW #11 due Wed., Dec. 11\n- HW #12 due Wed., Dec. 11\n\nWebAssign Details:\n- Access and purchase at http://webassign.net/student.html\n- Class Key: uri13731043\n- Students enroll using the class key with their own user IDs and passwords.\n- 5 submission attempts allowed per assignment.\n- 4-day extension with a 10-point penalty available once per assignment after due date.\n- Each student receives a unique set of problem numbers and answers.\n- 2-week free grace period to familiarize with WebAssign.\n\nHomework Policy:\n- Submit by 10 p.m. due date.\n- Different problem sets per student.\n- Extensions available with penalties as specified.",
    "exams": "There will be three unit exams and a cumulative final exam.\n\nExam Details:\n- All exams are closed book; only calculators and allowed formula sheets can be used.\n- Unit Exams:\n  - Unit Exam 1: Chaps. 1, 3, 4 on Fri., Sep. 27\n  - Unit Exam 2: Chaps. 5-8 on Fri., Oct. 25\n  - Unit Exam 3: Chaps. 9-11, 15 on Wed., Dec. 11\n- Final Exam:\n  - Comprehensive covering Chaps. 1-11, 15\n  - Date: To Be Announced (TBA)\n  - If a part of the final exam score is higher than the corresponding unit exam score, it replaces the unit score in the semester grade calculation.\n  - Final exam scores do not replace unit exam scores if lower.\n\nExam Format:\n- Closed book with permitted calculators.\n- Formula sheets:\n  - Unit Exams: 1 sheet per exam\n  - Final Exam: 3 sheets\n\nNote: If the course goes remote, the exam schedule and grading scheme may be modified.",
    "readings": "Weekly Reading Assignments:\n\n- HW #1 (Wed., Sept. 11): Chapter 1\n- HW #2 (Wed., Sept. 18): Sections 3.1-3.5\n- HW #3 (Fri., Sept. 25): Sections 2.1-2.3, 4.1-4.3\n- HW #4 (Fri., Oct. 4): Chapter 5\n- HW #5 (Fri., Oct. 18): Sections 4.4, 6.1-6.3\n- HW #6 (Fri., Oct. 25): 1st part of Sec. 2.4, Chapter 7\n- HW #7 (Fri., Oct. 30): Chapter 8\n- HW #8 (Wed., Nov. 6): No Homework due\n- HW #9 (Wed., Nov. 13): Sections 10.1-10.6\n- HW #10 (Wed., Dec. 4): Sections 2.4 (2nd part), 11-11.3\n- HW #11 (Wed., Dec. 11): Sections 13.1-13.5\n- HW #12 (Wed., Dec. 11): Sections 15.1, 15.2, 15.4\n\nLab Readings:\n- Refer to specific laboratory experiment readings as per PHY273 Laboratory Policies.\n\nAdditional Readings:\n- Any additional readings will be posted on Brightspace as needed.",
    "special_sessions": "PHY273: LABORATORY AND RECITATION FOR ELEMENTARY PHYSICS I\n\nComponents:\n1. Laboratory\n2. Recitation\n\nRecitation:\n- Separate enrollment required.\n- Held in Room 112.\n- Recitation grade counts toward PHY203 grade (up to 250 points).\n- No separate letter grade for PHY273 recitation.\n- Must solve 3 problems in each recitation to receive full credit; extra problems can cover missed ones from previous sessions.\n\nLaboratory:\n- Separate enrollment for laboratory sections.\n- Laboratory Schedule:\n  - Intro Lab: 9/9-13\n  - 1. Motion in 1D (free fall): 9/16-20\n  - 1. Motion in 1D (analysis): 9/23-27\n  - 2. Motion in 2D (projectiles): 9/30-10/4\n  - 2. Motion in 2D (analysis): 10/7-11\n  - 3. Newton's laws: 10/14-18\n  - 4. Conservation of Energy: 10/21-25\n  - 5. Collisions (experiment): 10/28-11/1\n  - 5. Collisions (analysis): 11/4-15\n  - 6. Ballistic Pendulum: 11/18-22\n  - 7. Rotational dynamics: 12/2-12/6\n  - Make-up Lab (Pendulum): 12/12 (Reading Day)\n- Lab Registration:\n  - Register for one of the 000x laboratory sections and one of the R0x recitation sections.\n- Make-up Labs:\n  - Only one make-up lab available at the end of the semester for missed experiments, with prior permission from the TA.\n- Lab Requirements:\n  - Purchase lab manual in advance or at first lab meeting.\n  - Bring an acceptable lab notebook (e.g., National Brand Computation Notebook, Model number 43-648) to the first lab meeting.\n\nAdditional Special Sessions:\n- COVID-19 related adjustments as per university guidelines.\n- Academic Enhancement Center resources available for academic support.",
    "UUID": "b674edfc-3115-469d-8e8e-c8ae4db76bb9"
}