{
    "course_identification": "PHY203: ELEMENTARY PHYSICS I (Fall 2024)\nInstructor: Miquel Dorca, 211 East Hall, miquel@uri.edu\nOffice Hours: MWF 12:30pm -1:00pm\nLecture Times: 1pm-1:50pm (section 1), (East Hall Auditorium)",
    "instructor_information": "Miquel Dorca\nEmail: miquel@uri.edu\nOffice Location: 211 East Hall\nOffice Hours: MWF 12:30pm -1:00pm",
    "course_description_prerequisites": "Course Description Calculus -based i ntroductio n to Newtonian mechanics. Kine matics and dynamics of particles and systems of particles , conservation laws, rotational motion, gravitation, and oscillatory motion. (Lec. 3 ) Pre: credit or concurrent enrollment in MTH 141 and concurrent enrollment in PHY 273. Intended for science and engineering majors.\nText: University Physics (Open Stax), 1st Edition, Volume 1 University Physics from Open Stax is a free, open access textb ook that can be found at https://openstax.org/subjects/science.",
    "learning_objectives": "1. To demonstrate an understanding of the basic concepts of classical mechanics.\n2. To apply a conceptual understanding of classical mechanics to physics problems.\n3. To develop problem -solving strategies and techniques appropriate to classical mechanics.\n4. To be able to carry out quantitative solutions of classical mechanics problems.\n5. To be able to carry out, analyze, and present the results of classical mechanics laboratory experiments.",
    "required_texts_materials": "Text: University Physics (Open Stax), 1st Edition, Volume 1 University Physics from Open Stax is a free, open access textbook that can be found at https://openstax.org/subjects/science.",
    "course_requirements_grading_policy": "Course Grade: The grade for PHY203 will be based on a maximum of 1200 points : unit exams 400 points final exam 400 points homework 150 points recitation 250 points\nGrading Scheme : A(93 -100); A -(90-93); B+(87 -90); B(83 -87); B -(80-83); C+(77 -80); C(73 -77); C-(70-73); D+(67 -70); D(60 -67); F(<60).",
    "assignments_exams": "Examinations: There will be three unit exams and a cumulative final exam. All exams are closed book and no other resources are allowed. Calculators will be permitted. You will be allowed to bring a sheet of paper containing relevant formulas for each unit exam and 3 sheets for the final. A unit exam will be given at the end of each of the first three course units. The dates and times are listed below.\nCourse Units: The course is divide d into three units as follows:\nunit #1 Chaps. 1,3,4 exam on Fri. 09/27\nunit #2 Chaps. 5 -8 exam on Fri. 10/25\nunit #3 Chaps. 9 -11,15 exam on Wed ., 12/11\nFinal Exam Chaps. 1 -11,15 tba\nFinal Exam: The final exam will consist of 3 parts each corresponding to the 3 unit exams above. If the score on a part of the final exam is higher than the score on the corresponding unit exam, the score on that section of the final exam will replace the unit exam score when your semester grade is calculated. However, the scores of the final are not replaced if they are lower than the scores of the unit exams.",
    "course_schedule": "Homework Assignments: A set of homework problems will be due on or before (usually Wednesdays or Fridays) of almost every week ( by 10 p.m. ) and will be administered through a web -based system called WebAssign (see below). Course Grade: The grade for PHY203 will be based on a maximum of 1200 points : unit exams 400 points final exam 400 points homework 150 points recitation 250 points Grading Scheme : A(93 -100); A -(90-93); B+(87 -90); B(83 -87); B -(80-83); C+(77 -80); C(73 -77); C-(70-73); D+(67 -70); D(60 -67); F(<60). WebAssign: Homework and recitations will be administered through a web -based service named WebAssign. WebAssign can be accessed and purchased at http://webassign.net/student.html The Class Key for WebAssign for this course is: uri 1373 1043 A recent check showed that it was cheaper to purchase Webassign/Openstax for 2 semesters, since it will be used for PHY204 as well. Here’s a specific link to openstax/webassign: https://webassign.net/features/textbooks/osuniphys1/details.html . Here’s a link about pricing: https://www.cengage.com/c/webassign -for-openstax - university -physics -1e-ling/9781337799942/?filterBy=Higher -Education#compare -buying - options . Students will enroll with this class key, creating their own user IDs and password. When they go to the login page, they simply click the box saying \"ENTER CLASS KEY\". You will have 5 chances to submit your homework solutions before the due date. After the due date, a 4 day extension with a 10 point penalty can be selected in WebAssign (available once only per assignment -and must be selected 4 days after the assignment is due ). In WebAssign each student gets a different set of numbers in the problems, so the answers will be different. Try logging on well before the first assignment due date and become familiar with the WebAssign system. There is a 2 -week (free) grace period for you to get s tarted. Recitation: All students must also register for a recitation section of PHY273. Separate enrollment is required . The recitations will be held in Room 112. Your recitation grade will be counted toward your PHY203 grade up to a maximum of 250 points . There is no separate letter grade for the recitation of PH273. You must correctly solve 3 problems in each recitation to get full credit for the section. Solving more than 3 problems will c ount for missed problems in previous recitation meetings.",
    "course_policies": "",
    "communication_student_support": "",
    "university_wide_policies_resources": "",
    "separate_laboratory_sections": "PHY273: LABORATORY AND RECITATION FOR ELEMENTARY PHYSICS I\nPHY273 is closely connected to PHY203. It consists of two components: Laboratory and Recitation. Separate enrollment in each is required.\nYour recitation grade will be absorbed into your PHY203 grade, but you will be getting a separate letter grade for the lab section of PHY273 (1 credit).",
    "practicum_clinical_experiences": "",
    "field_trips_off_campus_activities": "",
    "service_learning_community_engagement_projects": "",
    "studio_workshop_sessions": "",
    "performance_recital_production_requirements": "",
    "safety_protocols_lab_attire_expanded": "A lab manual must be purchased either in advance or at the first lab meeting. Please bring an acceptable lab notebook to your first lab meeting. The following is the most common, durable and least expensive of its kind we have recommended before : National Brand Computation Notebook, Model number 43 -648, 75 sheets with no carbon paper.",
    "internship_fieldwork_documentation": "",
    "emergency_health_safety_protocols_course_specific": "",
    "ethics_controversial_content_statements": "We respect the rights and dignity of each individual and group. We reject prejudice and intolerance, and we work to understand differences. We believe that equity and inclusion are critical components for campus community memb ers to thrive. If you are a target or a witness of a bias incident, you are encouraged to submit a report to the URI Bias Response Team at www.uri.edu/brt . There you will also find people and resources to help. \nDisability Services for Students Statement : Your access in this course is important. Please send me your Disability Services for Students (DSS) accommodation letter early in the semester so that we have adequate time to discuss and arrange your approved academic accommodations. If you have not yet established services through DSS, please contact them to engage in a confidential conversation about the process for requesting reasonable accommodations in the classroom. DSS can be reached by calling: 401-874-2098, visiting: web.uri.edu/disability , or emailing: dss@etal.uri.edu . We are available to meet with students enrolled in Kingston as well as Providence courses.\nAcademic Enhancement Center (for undergraduate courses) : Located in Roosevelt Hall, the AEC offers free face -to- face and web -based services to undergraduate students seeking academic support. Peer tutoring is available for STEM - related courses by appointment online and in -person. The Writing Center offers peer tutoring focused on supporting undergraduate writers at any stage of a writing assignment. The UCS160 course and academic skills consultations offer students strategies and activities aimed at improving their studying and test -taking skills. Complete details about each of these programs, up -to-date schedules, contact information and self-service study resources are all available on the AEC website, uri.edu/aec .",
    "unclassified_content": [
        "Elementary Physics will continue for two more semesters: Y204: Electricity and magnetism.Y205: Thermodynamics, waves, acoustics, optics.",
        "Exam and Homework Schedule",
        "Wed., Sept. 11 HW #1 due Reading: Chapter 1",
        "Wed., Sept. 18 HW #2 due Reading: Sections 3.1-3.5",
        "Wed., Sept. 25 HW #3 due Reading: Sections 2.1-2.3, 4.1-4.3",
        "Fri., Sept. 27 Exam #1 (Chaps. 1,3,4 )",
        "Fri., Oct. 4 HW #4 due Reading: Chap. 5",
        "Fri., Oct. 11 HW #5 due Reading: Sections 4.4, 6.1-6.3",
        "Fri., Oct. 18 HW #6 due Reading: 1st part of Sec. 2.4, Chap. 7",
        "Fri., Oct. 25 HW #7 due Reading: Chap. 8",
        "Fri., Oct. 25 Exam #2 (Chaps. 5-8)",
        "Wed., Oct. 30 No Homework due Reading: Sections 9.1-9.6",
        "Wed., Nov. 13 No Homework due Reading: Sections 10.1 -10.6",
        "Wed., Nov. 20 HW #9 due Reading: 2nd part of Sec. 2.4, Secs. 11 -11.3",
        "Wed., Nov. 27 HW #10 due Reading: Sections 13.1 -13.5",
        "Wed., Dec. 4 HW #11 due Reading: Sections 15.1,15.2,15.4",
        "Wed., Dec. 11 HW #12 due Reading: Sections 15.1,15.2,15.4",
        "Wed ., Dec. 11 Exam #3 (Chaps. 9-11,15 )",
        "Final Exam TBA Chaps. 1 -11,15"
    ],
    "UUID": "eaa553191c22bce2227bdca34316e6b98b3ead43b3895fb550dcaaf7a40db03c",
    "parsing_method_used": "llm",
    "segmentation_timestamp": "2025-05-26T22:36:41.376621"
}