{
  "course_identification": "",
  "instructor_information": "",
  "course_description_prerequisites": "",
  "learning_objectives": "",
  "required_texts_materials": "",
  "course_requirements_grading_policy": "",
  "assignments_exams": "",
  "course_schedule": "",
  "course_policies": "",
  "communication_student_support": "",
  "university_wide_policies_resources": "",
  "unclassified_content": [
    "Brightspace: The class will use Brightspace for class announcements and all lectures will be posted there. If the course needs to go remote (due to a weather cancellation, for instance) the lectures will be given asynchronously on Brightspace. This course will be taught in person (besides any possible weather related cancellations). However, if there are no further notices, the course will be given asynchronously on Brightspace on the following three dates: November 25th, 27th, December 2nd",
    "Anti-Bias Syllabus Statement: We respect the rights and dignity of each individual and group. We reject prejudice and intolerance, and we work to understand differences. We believe that equity and inclusion are critical components for campus community members to thrive. If you are a target or a witness of a bias incident, you are encouraged to submit a report to the URI Bias Response Team at www.uri.edu/brt. There you will also find people and resources to help.",
    "COVID-19 Statement: The University is committed to delivering its educational mission while protecting the health and safety of our community. While the university has worked to create a healthy learning environment for all, it is up to all of us to ensure our campus stays that way. As members of the URI community, students are required to comply with standards of conduct and take precautions to keep themselves and others safe. Visit web.uri.edu/coronavirus/ for the latest information about the URI COVID-19 response."
  ],
  "UUID": "eaa553191c22bce2227bdca34316e6b98b3ead43b3895fb550dcaaf7a40db03c",
  "parsing_method_used": "llm",
  "segmentation_timestamp": "2025-05-23T10:10:57.064995"
}